In [3]:
import pandas as pd

In [4]:
technologies=({
    "Courses":["spark","pyspark","hadoop","pandas"],
    "Fee":["28000","19000","21000","25000"],
    "Duration":["30days","40days","50days","60days"],
    "Duration":["300","400","1500","1000"],
})

In [5]:
df = pd.DataFrame(technologies, index = ['r1', 'r2', 'r3', 'r4'])
print(df)

    Courses    Fee Duration
r1    spark  28000      300
r2  pyspark  19000      400
r3   hadoop  21000     1500
r4   pandas  25000     1000

In [6]:
df2=df.reindex(["r1","row2","r3","r4",],fill_value="testing")
df2

      Courses      Fee Duration
r1      spark    28000      300
row2  testing  testing  testing
r3     hadoop    21000     1500
r4     pandas    25000     1000

Selecting and Slicing 
1 : loc  location using named index
2 : iloc  location using integer index

In [7]:
import numpy as np

In [8]:
df=pd.DataFrame(np.random.rand(8,4),index=['a','b','c','d','e','f','g','h'],columns=['A','B','C','D'])
df

          A         B         C         D
a  0.121142  0.383021  0.015023  0.557399
b  0.947371  0.787078  0.472376  0.241334
c  0.147888  0.215557  0.767658  0.618970
d  0.644650  0.241707  0.873380  0.276483
e  0.041459  0.504353  0.372321  0.498093
f  0.548951  0.155461  0.034098  0.753031
g  0.612036  0.205898  0.316917  0.606129
h  0.804630  0.004937  0.024013  0.932413

In [9]:
# Slicing
df.loc['a':'d','A':'D']

          A         B         C         D
a  0.121142  0.383021  0.015023  0.557399
b  0.947371  0.787078  0.472376  0.241334
c  0.147888  0.215557  0.767658  0.618970
d  0.644650  0.241707  0.873380  0.276483

In [10]:
df.loc['b':'c','C':'D']

          C         D
b  0.472376  0.241334
c  0.767658  0.618970

In [11]:
df.loc['a']>1    # returns True or False

A    False
B    False
C    False
D    False
Name: a, dtype: bool

In [12]:
one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

In [13]:
two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])

In [14]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [15]:
data1 = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df1 = pd.DataFrame(data1, index=['a', 'b', 'c'])
df1

   A  B
a  1  4
b  2  5
c  3  6

In [16]:
data2 = {'C': [10, 20, 30], 'D': [40, 50, 60]}
df2 = pd.DataFrame(data2, index=['a', 'c', 'd'])
df2

    C   D
a  10  40
c  20  50
d  30  60

In [17]:
data1 = {'A': [1, 2, 3], 'B': [4, 5, 6], 'key': ['a', 'b', 'c']}
df1 = pd.DataFrame(data1)
df1

   A  B key
0  1  4   a
1  2  5   b
2  3  6   c

In [18]:
data2 = {'C': [10, 20, 30], 'D': [40, 50, 60], 'key': ['a', 'c', 'd']}
df2 = pd.DataFrame(data2)
df2

    C   D key
0  10  40   a
1  20  50   c
2  30  60   d

Integer Location (iloc)

In [20]:
df2.iloc[0:1,0:2]

    C   D
0  10  40